# RebarCurvesData Properties

---
The RebarCurvesData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RebarCurvesData Class
Autodesk.Revit.DB.Structure Namespace